<template>
  <div>
    <h1 style="text-align: center">使用教程</h1>
    <h2>一.从新建文档开始</h2>
    <p>1.在文档工具栏中，点击此按钮新建一份文档，当您有现成的文档时，点击此按钮打开文档</p>
    <p>2.文档新建完毕之后，您需要编辑文档的头信息，即点击此按钮编辑文档信息，在打开的选项框中填写您的文档信息</p>
    <p>3.点击此按钮可以将您完成的文档进行导出</p>
    <h2>二.如何向新建的文档中添加页面</h2>
    <p>1.在页面工具栏中，选择新建页面，选择您想添加的古籍图片，确认，此时在页面上可以看到您选择的图片，接下来可以进行下面的操作</p>
    <p>2.在添加多个页面时，您可以进行以下操作</p>
    <p>①点击此按钮可以将当前页面的位置向前移动一页，举个例子，现在您添加了三个页面，您选择第二个页面点击此按钮，则第二个页面会变成第一个页面，第一个页面会退到第二个页面</p>
    <p>②点击此按钮可以将当前页面位置向后移动一页，与上述操作正好相反</p>
    <p>③此按钮的功能是设定页码，直接更改到固定位置上，举个例子，一共有五个页面，您对第二个页面设定页码到5，那么第二个页面会变动到第五个上，原来的三四五位置会向前推动一页</p>
    <p>④此按钮功能是删除页面，功能是删除当前页面</p>
    <p>3.此按钮功能是按照模板切割页面，举个例子，点击此按钮您输入3 * 3，那么页面中会出现9宫格模样的自动切割页面，此功能在古籍文字整齐时使用起来更方便</p>
    <p>4，此按钮功能自动生成文档，点击此按钮，输入相应文字数据，会自动生成格式整齐的古籍类型的图片</p>
    <h2>三.如何在一个页面上进行操作</h2>
    <p>功能看不懂请参考第四步一起看</p>
    <p>1.请注意插件工具栏，此按钮功能是移动，选择此按钮，按住鼠标拖动，会拖动当前页面，滚动鼠标中键会进行缩放</p>
    <p>2.此按钮的功能是设置一个点，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，鼠标左键在页面上单击会生成一个新点，鼠标右键单击选中的点会删除该点</p>
    <p>3.此按钮功能是新建直线，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，当您依次点击两个点的时候会生成一条新的直线，如果中途想要取消新建直线，在点击第二个点之前右键单击一下即可，如果您想要删除一条直线，鼠标放在直线上右键单击一下</p>
    <p>4.此按钮功能是新建一个多边形，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，当您想要新建一个多边形时，依次点击多个点，再点击第一个点，即可生成多边形，如果中途想要取消新建多边形，在进行到最后一步之前点击鼠标右键，如果您想要删除一个多边形，鼠标放在一个多边形上右键单机一下</p>
    <p>5.此功能是自动生成一个多边形，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，将鼠标放在四个点中间点击鼠标左键即可自动生成一个多边形，如果您想要删除多边形，鼠标放在多边形上右键单击一下，即可删除</p>
    <p>6.此功能是为您选择的多边形添加文字，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，左键单击一个没有添加字符的多边形时，可以新增字符，左键单击已经添加字符的多边形时，可以修改字符，右键单击已有字符的多边形可以删除字符</p>
    <p>7.此功能是选择文章中的词汇，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，依次左键点击多边形可以将这几个多边形中的字符连成一个词汇，举个例子，这里有两个带字符的多边形分别是“您”、“好”，依次左键点击这两个多边形，即可以连成词汇“您好”，取消选中词时右键单击空白处或者右键单击其他多边形，删除词汇使用鼠标右键单击词汇</p>
    <p>8.此功能是选择文章中的句子，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，依次左键点击多边形可以将这几个多边形中的字符连成一个句子，举个例子，这里有四个带字符的多边形分别是“明”、“天”、“再”、“见”，依次左键点击这四个多边形，即可连成句子“明天再见”，取消选中句时右键单击空白处或者右键单击其他多边形，删除句子使用鼠标右键单击句子</p>
    <p>9.此功能是选择文章中的段落，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，依次左键点击多边形可以将这几个多边形中的字符连成一个段落,取消选中段落时右键单击空白处或者右键单击其他多边形，删除段落使用鼠标右键单击段落</p>
    <p>10.此功能是选择一篇文章，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，依次左键点击多边形可以将这几个多边形中的字符连成一篇文章,取消选中文章时右键单击空白处或者右键单击其他多边形，删除文章使用鼠标右键单击文章</p>
    <p>11.此功能是选择一本书籍，当您选择此功能时，拖动变成按住鼠标中键拖动，滚动鼠标中键进行缩放，依次左键点击多边形可以将这几个多边形中的字符连成一本书籍,取消选中书籍时右键单击空白处或者右键单击其他多边形，删除书籍使用鼠标右键单击书籍</p>
    <h2>四.流程示例</h2>
    <p>1.以李白《静夜思》为例，展示一整套操作流程</p>
    <p>2.依次按照第三步中功能提示，将每一个字套上一层多边形，以及给每一个多边形中添加其相应的字符，完成之后，我们得到了《静夜思》中的全部的20个字</p>
    <p>3.根据断句，我们可以将床前、明月光、疑是、地上霜、举头、望明月、低头、思故乡看作是一个词，分别使用词工具将其进行分类（做例子用，具体怎么划分以及是否划分由使用者具体斟酌）</p>
    <p>4.下一步我们可以将其进行分句，这时候可以使用句工具进行分类，分成四个句子，即床前明月光、疑是地上霜、举头望明月、低头思故乡（做例子用，具体怎么划分以及是否划分由使用者具体斟酌）</p>
    <p>5.如果我们将前两句看作一段，后两句看作另一段，即可以使用段落工具将其分成两段（做例子用，具体怎么划分以及是否划分由使用者具体斟酌）</p>
    <p>6.整篇文章可以使用文章工具做个标记，标注这两段为一篇文章</p>
    <p>7.这些都完成之后，可以进行上传了，上传到服务器端即可在搜索引擎那边使用关键词查询</p>
  </div>

</template>

<script>
export default {
  name: "guide"
}
</script>

<style scoped>

</style>
